GopalSaraf/Practicals/PSDL/include/proc/pic16f15385.inc
// Register: ODCONF
#define ODCONF ODCONF
ODCONF                                   equ 01E52h
// bitfield definitions
ODCONF_ODCF0_POSN                        equ 0000h
ODCONF_ODCF0_POSITION                    equ 0000h
ODCONF_ODCF0_SIZE                        equ 0001h
ODCONF_ODCF0_LENGTH                      equ 0001h
ODCONF_ODCF0_MASK                        equ 0001h
ODCONF_ODCF1_POSN                        equ 0001h
ODCONF_ODCF1_POSITION                    equ 0001h
ODCONF_ODCF1_SIZE                        equ 0001h
ODCONF_ODCF1_LENGTH                      equ 0001h
ODCONF_ODCF1_MASK                        equ 0002h
ODCONF_ODCF2_POSN                        equ 0002h
ODCONF_ODCF2_POSITION                    equ 0002h
ODCONF_ODCF2_SIZE                        equ 0001h
ODCONF_ODCF2_LENGTH                      equ 0001h
ODCONF_ODCF2_MASK                        equ 0004h
ODCONF_ODCF3_POSN                        equ 0003h
ODCONF_ODCF3_POSITION                    equ 0003h
ODCONF_ODCF3_SIZE                        equ 0001h
ODCONF_ODCF3_LENGTH                      equ 0001h
ODCONF_ODCF3_MASK                        equ 0008h
ODCONF_ODCF4_POSN                        equ 0004h
ODCONF_ODCF4_POSITION                    equ 0004h
ODCONF_ODCF4_SIZE                        equ 0001h
ODCONF_ODCF4_LENGTH                      equ 0001h
ODCONF_ODCF4_MASK                        equ 0010h
ODCONF_ODCF5_POSN                        equ 0005h
ODCONF_ODCF5_POSITION                    equ 0005h
ODCONF_ODCF5_SIZE                        equ 0001h
ODCONF_ODCF5_LENGTH                      equ 0001h
ODCONF_ODCF5_MASK                        equ 0020h
ODCONF_ODCF6_POSN                        equ 0006h
ODCONF_ODCF6_POSITION                    equ 0006h
ODCONF_ODCF6_SIZE                        equ 0001h
ODCONF_ODCF6_LENGTH                      equ 0001h
ODCONF_ODCF6_MASK                        equ 0040h
ODCONF_ODCF7_POSN                        equ 0007h
ODCONF_ODCF7_POSITION                    equ 0007h
ODCONF_ODCF7_SIZE                        equ 0001h
ODCONF_ODCF7_LENGTH                      equ 0001h
ODCONF_ODCF7_MASK                        equ 0080h

// Register: SLRCONF
#define SLRCONF SLRCONF
SLRCONF                                  equ 01E53h
// bitfield definitions
SLRCONF_SLRF0_POSN                       equ 0000h
SLRCONF_SLRF0_POSITION                   equ 0000h
SLRCONF_SLRF0_SIZE                       equ 0001h
SLRCONF_SLRF0_LENGTH                     equ 0001h
SLRCONF_SLRF0_MASK                       equ 0001h
SLRCONF_SLRF1_POSN                       equ 0001h
SLRCONF_SLRF1_POSITION                   equ 0001h
SLRCONF_SLRF1_SIZE                       equ 0001h
SLRCONF_SLRF1_LENGTH                     equ 0001h
SLRCONF_SLRF1_MASK                       equ 0002h
SLRCONF_SLRF2_POSN                       equ 0002h
SLRCONF_SLRF2_POSITION                   equ 0002h
SLRCONF_SLRF2_SIZE                       equ 0001h
SLRCONF_SLRF2_LENGTH                     equ 0001h
SLRCONF_SLRF2_MASK                       equ 0004h
SLRCONF_SLRF3_POSN                       equ 0003h
SLRCONF_SLRF3_POSITION                   equ 0003h
SLRCONF_SLRF3_SIZE                       equ 0001h
SLRCONF_SLRF3_LENGTH                     equ 0001h
SLRCONF_SLRF3_MASK                       equ 0008h
SLRCONF_SLRF4_POSN                       equ 0004h
SLRCONF_SLRF4_POSITION                   equ 0004h
SLRCONF_SLRF4_SIZE                       equ 0001h
SLRCONF_SLRF4_LENGTH                     equ 0001h
SLRCONF_SLRF4_MASK                       equ 0010h
SLRCONF_SLRF5_POSN                       equ 0005h
SLRCONF_SLRF5_POSITION                   equ 0005h
SLRCONF_SLRF5_SIZE                       equ 0001h
SLRCONF_SLRF5_LENGTH                     equ 0001h
SLRCONF_SLRF5_MASK                       equ 0020h
SLRCONF_SLRF6_POSN                       equ 0006h
SLRCONF_SLRF6_POSITION                   equ 0006h
SLRCONF_SLRF6_SIZE                       equ 0001h
SLRCONF_SLRF6_LENGTH                     equ 0001h
SLRCONF_SLRF6_MASK                       equ 0040h
SLRCONF_SLRF7_POSN                       equ 0007h
SLRCONF_SLRF7_POSITION                   equ 0007h
SLRCONF_SLRF7_SIZE                       equ 0001h
SLRCONF_SLRF7_LENGTH                     equ 0001h
SLRCONF_SLRF7_MASK                       equ 0080h

// Register: INLVLF
#define INLVLF INLVLF
INLVLF                                   equ 01E54h
// bitfield definitions
INLVLF_INLVLF0_POSN                      equ 0000h
INLVLF_INLVLF0_POSITION                  equ 0000h
INLVLF_INLVLF0_SIZE                      equ 0001h
INLVLF_INLVLF0_LENGTH                    equ 0001h
INLVLF_INLVLF0_MASK                      equ 0001h
INLVLF_INLVLF1_POSN                      equ 0001h
INLVLF_INLVLF1_POSITION                  equ 0001h
INLVLF_INLVLF1_SIZE                      equ 0001h
INLVLF_INLVLF1_LENGTH                    equ 0001h
INLVLF_INLVLF1_MASK                      equ 0002h
INLVLF_INLVLF2_POSN                      equ 0002h
INLVLF_INLVLF2_POSITION                  equ 0002h
INLVLF_INLVLF2_SIZE                      equ 0001h
INLVLF_INLVLF2_LENGTH                    equ 0001h
INLVLF_INLVLF2_MASK                      equ 0004h
INLVLF_INLVLF3_POSN                      equ 0003h
INLVLF_INLVLF3_POSITION                  equ 0003h
INLVLF_INLVLF3_SIZE                      equ 0001h
INLVLF_INLVLF3_LENGTH                    equ 0001h
INLVLF_INLVLF3_MASK                      equ 0008h
INLVLF_INLVLF4_POSN                      equ 0004h
INLVLF_INLVLF4_POSITION                  equ 0004h
INLVLF_INLVLF4_SIZE                      equ 0001h
INLVLF_INLVLF4_LENGTH                    equ 0001h
INLVLF_INLVLF4_MASK                      equ 0010h
INLVLF_INLVLF5_POSN                      equ 0005h
INLVLF_INLVLF5_POSITION                  equ 0005h
INLVLF_INLVLF5_SIZE                      equ 0001h
INLVLF_INLVLF5_LENGTH                    equ 0001h
INLVLF_INLVLF5_MASK                      equ 0020h
INLVLF_INLVLF6_POSN                      equ 0006h
INLVLF_INLVLF6_POSITION                  equ 0006h
INLVLF_INLVLF6_SIZE                      equ 0001h
INLVLF_INLVLF6_LENGTH                    equ 0001h
INLVLF_INLVLF6_MASK                      equ 0040h
INLVLF_INLVLF7_POSN                      equ 0007h
INLVLF_INLVLF7_POSITION                  equ 0007h
INLVLF_INLVLF7_SIZE                      equ 0001h
INLVLF_INLVLF7_LENGTH                    equ 0001h
INLVLF_INLVLF7_MASK                      equ 0080h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 01E8Fh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 01E90h
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0006h
INTPPS_INTPPS_LENGTH                     equ 0006h
INTPPS_INTPPS_MASK                       equ 003Fh
INTPPS_INTPPS0_POSN                      equ 0000h
INTPPS_INTPPS0_POSITION                  equ 0000h
INTPPS_INTPPS0_SIZE                      equ 0001h
INTPPS_INTPPS0_LENGTH                    equ 0001h
INTPPS_INTPPS0_MASK                      equ 0001h
INTPPS_INTPPS1_POSN                      equ 0001h
INTPPS_INTPPS1_POSITION                  equ 0001h
INTPPS_INTPPS1_SIZE                      equ 0001h
INTPPS_INTPPS1_LENGTH                    equ 0001h
INTPPS_INTPPS1_MASK                      equ 0002h
INTPPS_INTPPS2_POSN                      equ 0002h
INTPPS_INTPPS2_POSITION                  equ 0002h
INTPPS_INTPPS2_SIZE                      equ 0001h
INTPPS_INTPPS2_LENGTH                    equ 0001h
INTPPS_INTPPS2_MASK                      equ 0004h
INTPPS_INTPPS3_POSN                      equ 0003h
INTPPS_INTPPS3_POSITION                  equ 0003h
INTPPS_INTPPS3_SIZE                      equ 0001h
INTPPS_INTPPS3_LENGTH                    equ 0001h
INTPPS_INTPPS3_MASK                      equ 0008h
INTPPS_INTPPS4_POSN                      equ 0004h
INTPPS_INTPPS4_POSITION                  equ 0004h
INTPPS_INTPPS4_SIZE                      equ 0001h
INTPPS_INTPPS4_LENGTH                    equ 0001h
INTPPS_INTPPS4_MASK                      equ 0010h
INTPPS_INTPPS5_POSN                      equ 0005h
INTPPS_INTPPS5_POSITION                  equ 0005h
INTPPS_INTPPS5_SIZE                      equ 0001h
INTPPS_INTPPS5_LENGTH                    equ 0001h
INTPPS_INTPPS5_MASK                      equ 0020h

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 01E91h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0006h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0006h
T0CKIPPS_T0CKIPPS_MASK                   equ 003Fh
T0CKIPPS_T0CKIPPS0_POSN                  equ 0000h
T0CKIPPS_T0CKIPPS0_POSITION              equ 0000h
T0CKIPPS_T0CKIPPS0_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS0_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS0_MASK                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSN                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSITION              equ 0001h
T0CKIPPS_T0CKIPPS1_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS1_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS1_MASK                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSN                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSITION              equ 0002h
T0CKIPPS_T0CKIPPS2_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS2_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS2_MASK                  equ 0004h
T0CKIPPS_T0CKIPPS3_POSN                  equ 0003h
T0CKIPPS_T0CKIPPS3_POSITION              equ 0003h
T0CKIPPS_T0CKIPPS3_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS3_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS3_MASK                  equ 0008h
T0CKIPPS_T0CKIPPS4_POSN                  equ 0004h
T0CKIPPS_T0CKIPPS4_POSITION              equ 0004h
T0CKIPPS_T0CKIPPS4_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS4_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS4_MASK                  equ 0010h
T0CKIPPS_T0CKIPPS5_POSN                  equ 0005h
T0CKIPPS_T0CKIPPS5_POSITION              equ 0005h
T0CKIPPS_T0CKIPPS5_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS5_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS5_MASK                  equ 0020h

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 01E92h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0006h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0006h
T1CKIPPS_T1CKIPPS_MASK                   equ 003Fh
T1CKIPPS_T1CKIPPS0_POSN                  equ 0000h
T1CKIPPS_T1CKIPPS0_POSITION              equ 0000h
T1CKIPPS_T1CKIPPS0_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS0_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS0_MASK                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSN                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSITION              equ 0001h
T1CKIPPS_T1CKIPPS1_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS1_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS1_MASK                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSN                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSITION              equ 0002h
T1CKIPPS_T1CKIPPS2_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS2_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS2_MASK                  equ 0004h
T1CKIPPS_T1CKIPPS3_POSN                  equ 0003h
T1CKIPPS_T1CKIPPS3_POSITION              equ 0003h
T1CKIPPS_T1CKIPPS3_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS3_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS3_MASK                  equ 0008h
T1CKIPPS_T1CKIPPS4_POSN                  equ 0004h
T1CKIPPS_T1CKIPPS4_POSITION              equ 0004h
T1CKIPPS_T1CKIPPS4_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS4_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS4_MASK                  equ 0010h
T1CKIPPS_T1CKIPPS5_POSN                  equ 0005h
T1CKIPPS_T1CKIPPS5_POSITION              equ 0005h
T1CKIPPS_T1CKIPPS5_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS5_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS5_MASK                  equ 0020h

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 01E93h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0006h
T1GPPS_T1GPPS_LENGTH                     equ 0006h
T1GPPS_T1GPPS_MASK                       equ 003Fh
T1GPPS_T1GPPS0_POSN                      equ 0000h
T1GPPS_T1GPPS0_POSITION                  equ 0000h
T1GPPS_T1GPPS0_SIZE                      equ 0001h
T1GPPS_T1GPPS0_LENGTH                    equ 0001h
T1GPPS_T1GPPS0_MASK                      equ 0001h
T1GPPS_T1GPPS1_POSN                      equ 0001h
T1GPPS_T1GPPS1_POSITION                  equ 0001h
T1GPPS_T1GPPS1_SIZE                      equ 0001h
T1GPPS_T1GPPS1_LENGTH                    equ 0001h
T1GPPS_T1GPPS1_MASK                      equ 0002h
T1GPPS_T1GPPS2_POSN                      equ 0002h
T1GPPS_T1GPPS2_POSITION                  equ 0002h
T1GPPS_T1GPPS2_SIZE                      equ 0001h
T1GPPS_T1GPPS2_LENGTH                    equ 0001h
T1GPPS_T1GPPS2_MASK                      equ 0004h
T1GPPS_T1GPPS3_POSN                      equ 0003h
T1GPPS_T1GPPS3_POSITION                  equ 0003h
T1GPPS_T1GPPS3_SIZE                      equ 0001h
T1GPPS_T1GPPS3_LENGTH                    equ 0001h
T1GPPS_T1GPPS3_MASK                      equ 0008h
T1GPPS_T1GPPS4_POSN                      equ 0004h
T1GPPS_T1GPPS4_POSITION                  equ 0004h
T1GPPS_T1GPPS4_SIZE                      equ 0001h
T1GPPS_T1GPPS4_LENGTH                    equ 0001h
T1GPPS_T1GPPS4_MASK                      equ 0010h
T1GPPS_T1GPPS5_POSN                      equ 0005h
T1GPPS_T1GPPS5_POSITION                  equ 0005h
T1GPPS_T1GPPS5_SIZE                      equ 0001h
T1GPPS_T1GPPS5_LENGTH                    equ 0001h
T1GPPS_T1GPPS5_MASK                      equ 0020h

